MateoSegura/ESP32-Utilities/src/main.cpp
#include <Arduino.h>
#include <esp32_utilities.h>

#define TIME_STAMP_uS false

SystemOnChip SoC;
BluetoothLowEnergyServer myBLEserver;
Terminal myTerminal;
RealTimeClock myRTC;

ARD1867 myADC;
LTC1867 ltc1867;
ADS1015 ads1015;

// * HSPI
#define ADC_CS_PIN 4
#define HSPI_SDI_PIN 23
#define HSPI_SDO_PIN 19
#define HSPI_SCK_PIN 18
#define HSPI_SCK_FREQUENCY 40000

void sampleADC();

void setup()
{
  // -- Begin UART port for debug output
  SoC.uart0.begin(115200);

  myTerminal.begin(&SoC.uart0, TIME_STAMP_uS);

  // Print App title
  myTerminal.println("\n\n");
  myTerminal.println("************************************************************************");
  myTerminal.println("*                        My App Name Goes here                         *"); // Replace with your title
  myTerminal.println("************************************************************************");
  myTerminal.println("\n\n");

  TerminalMessage myMessage = TerminalMessage("Testing ADC",
                                              "APP",
                                              INFO,
                                              micros());
  
  // -- Enable ADC (P Channel MOSFET)

  // -- Begin SPI bus for ADC
  SoC.hspi.begin(HSPI_SCK_PIN, HSPI_SDO_PIN, HSPI_SDI_PIN);
  SoC.hspi.setFrequency(HSPI_SCK_FREQUENCY);

  // -- Begin ADC
  uint16_t reading = ltc1867.begin(ADC_CS_PIN, SoC.hspi, HSPI_SCK_FREQUENCY);

  myTerminal.println(String(reading));
}

void loop()
{
  delay(10);
}

void speedProfile()
{
  unsigned int k = 0;
  unsigned long startTime, endTime;

  myADC.ltc186xChangeChannel(LTC186X_CHAN_SINGLE_0P, 1);

  myTerminal.print("Starting speed profile on channel 0\n");

  startTime = millis();
  for (unsigned long i = 0; i < 100000; i++)
  {
    k += myADC.ltc186xRead();
  }
  endTime = millis();

  myTerminal.print("Max data rate ");
  myTerminal.print(String(100000UL / (endTime - startTime)));
  myTerminal.print(" ksps\n");
}

byte confChan = 0;
byte loopCounter = 0;

void sampleADC()
{
  // print the results to the serial monitor:

  myTerminal.print("Channel ");
  myTerminal.print(String(confChan));
  myTerminal.print(" Single Ended");
  myTerminal.print(" = [");
  myTerminal.print(String(myADC.ltc186xRead()));
  myTerminal.print("]\n");

  confChan++;
  if (confChan >= 8)
  {
    myTerminal.print("\n");
    confChan = 0;

    if (0 == loopCounter)
    {
      // Every 28 loops, run the speed profiler
      speedProfile();
    }
    loopCounter = (loopCounter + 1) % 4;
  }
  switch (confChan)
  {
  case 0:
    myADC.ltc186xChangeChannel(LTC186X_CHAN_SINGLE_0P, 1);
    break;

  case 1:
    myADC.ltc186xChangeChannel(LTC186X_CHAN_SINGLE_1P, 1);
    break;

  case 2:
    myADC.ltc186xChangeChannel(LTC186X_CHAN_SINGLE_2P, 1);
    break;

  case 3:
    myADC.ltc186xChangeChannel(LTC186X_CHAN_SINGLE_3P, 1);
    break;

  case 4:
    myADC.ltc186xChangeChannel(LTC186X_CHAN_SINGLE_4P, 1);
    break;

  case 5:
    myADC.ltc186xChangeChannel(LTC186X_CHAN_SINGLE_5P, 1);
    break;

  case 6:
    myADC.ltc186xChangeChannel(LTC186X_CHAN_SINGLE_6P, 1);
    break;

  case 7:
    myADC.ltc186xChangeChannel(LTC186X_CHAN_SINGLE_7P, 1);
    break;
  }

  delay(500);
}

// End.
